<a href="https://colab.research.google.com/github/LaraAyrolla/Python-Projects/blob/main/simple-lists/Python-List-10.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Programação de Soluções Computacionais**


10ª LISTA DE EXERCÍCIOS - SQL - PYTHON

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect('lista.db')
cursor = conn.cursor()

In [3]:
# 1 - Criar tabela Usuario com duas colunas:
# matricula e nome, sendo a primeira a chave primária

sql = '''CREATE TABLE usuario(
  matricula VARCHAR(100) PRIMARY KEY,
  nome VARCHAR(100) NOT NULL
)'''

cursor.execute(sql)

In [4]:
# 2 - Verificar se existe algum empregado que recebe mais que 4000

sql = '''ALTER TABLE usuario ADD empregado TINYINT(1) NOT NULL DEFAULT 0'''

cursor.execute(sql)

sql = '''ALTER TABLE usuario ADD salario FLOAT'''

cursor.execute(sql)

sql = 'INSERT INTO usuario (matricula, nome, empregado, salario) VALUES(?, ?, ?, ?)'

usuarios = [['123', 'Marina', '1', '4050'], ['456', 'Helena', '1', '4000'],\
['654', 'Caio', '0', '0'], ['321', 'Igor', '0', '0']]

for usuario in usuarios:
    cursor.execute(sql, usuario)
    print(usuario)

['123', 'Marina', '1', '4050']
['456', 'Helena', '1', '4000']
['654', 'Caio', '0', '0']
['321', 'Igor', '0', '0']

In [5]:
sql = '''SELECT
    u.salario
  FROM usuario u
  WHERE u.empregado = 1 AND u.salario > 4000
'''

cursor.execute(sql)

usuarios = cursor.fetchall()

if len(usuarios) > 0:
  print("Há %d usuários com o salário maior que R$ 4000,00" % len(usuarios))
else:
  print("Não há usuários com o salário maior que R$ 4000,00")

Há 1 usuários com o salário maior que R$ 4000,00

In [6]:
# 3 - Qual a média salarial, o maior e menor salário dos empregados?

sql = '''SELECT
    AVG(u.salario),
    MAX(u.salario),
    MIN(u.salario)
  FROM usuario u
  WHERE u.empregado = 1
'''

salarios = cursor.execute(sql)

for salario in salarios:
    print(salario)

(4025.0, 4050.0, 4000.0)

In [7]:
# 4 - Calcular o valor total recebido por cada empregado, considerando também a comissão
# (sal + comm)

sql = '''ALTER TABLE usuario ADD comissao FLOAT'''

cursor.execute(sql)

sql = '''UPDATE usuario SET comissao = 50 WHERE matricula = \'123\''''

cursor.execute(sql)

sql = '''UPDATE usuario SET comissao = 200 WHERE matricula = \'456\''''

cursor.execute(sql)

sql = '''SELECT
    u.nome,
    u.salario,
    u.comissao,
    u.salario + u.comissao AS valor_total
  FROM usuario u
  WHERE u.empregado = 1
'''

usuarios = cursor.execute(sql)

for usuario in usuarios:
    print(usuario)

('Marina', 4050.0, 50.0, 4100.0)
('Helena', 4000.0, 200.0, 4200.0)

In [8]:
# 5 - Exibir a data atual

sql = '''SELECT DATE('now')'''

dates = cursor.execute(sql)

for date in dates:
    print(date)

('2023-12-06',)

In [9]:
# 6 - Calcular o gasto total com salário por departamento

sql = '''ALTER TABLE usuario ADD departamento VARCHAR(100)'''

cursor.execute(sql)

sql = '''UPDATE usuario SET departamento = \'TI\' WHERE matricula = \'123\''''

cursor.execute(sql)

sql = '''UPDATE usuario SET departamento = \'comercial\' WHERE matricula = \'456\''''

cursor.execute(sql)

sql = '''SELECT
    u.departamento,
    SUM(u.salario),
    SUM(u.comissao),
    SUM(u.salario + u.comissao) AS valor_total
  FROM usuario u
  WHERE u.empregado = 1
  GROUP BY u.departamento
'''

departamentos = cursor.execute(sql)

for departamento in departamentos:
    print(departamento)

('TI', 4050.0, 50.0, 4100.0)
('comercial', 4000.0, 200.0, 4200.0)

In [10]:
# 7 - Calcular o número de dias de trabalho de cada empregado a partir
# da contratação (hiredate) até hoje

sql = '''ALTER TABLE usuario ADD hiredate DATE'''

cursor.execute(sql)

sql = '''UPDATE usuario SET hiredate = \'2023-12-04\' WHERE matricula = \'123\''''

cursor.execute(sql)

sql = '''UPDATE usuario SET hiredate = \'2022-12-05\' WHERE matricula = \'456\''''

cursor.execute(sql)

sql = '''SELECT
    u.matricula,
    u.nome,
    u.hiredate,
    CAST(julianday('now') - julianday(u.hiredate) AS INTEGER) AS dias_trabalhados
  FROM usuario u
  WHERE u.empregado = 1
'''

usuarios = cursor.execute(sql)

for usuario in usuarios:
    print(usuario)

('123', 'Marina', '2023-12-04', 2)
('456', 'Helena', '2022-12-05', 366)

In [11]:
# 8 - Exibir todos os funcionários com nomes iniciados com a letra M

sql = '''SELECT
    u.nome
  FROM usuario u
  WHERE u.nome LIKE \'M%\'
'''

usuarios = cursor.execute(sql)

for usuario in usuarios:
    print(usuario)

('Marina',)

In [12]:
# 9 - Exibir o nome dos empregados e o nome de seu respectivo departamento
 # (ordenar por departamento)

sql = '''SELECT
    u.nome,
    u.departamento
  FROM usuario u
  WHERE u.empregado = 1
  ORDER BY u.departamento ASC
'''

usuarios = cursor.execute(sql)

for usuario in usuarios:
    print(usuario)

('Marina', 'TI')
('Helena', 'comercial')

In [14]:
# 10 - Exibir o nome dos empregados e o nome do seu respectivo gerente
# (ordenar por gerente)

sql = '''ALTER TABLE usuario ADD COLUMN gerente VARCHAR(100)'''

cursor.execute(sql)

sql = '''UPDATE usuario SET gerente = \'456\' WHERE matricula = \'123\''''

cursor.execute(sql)

sql = '''UPDATE usuario SET gerente = \'123\' WHERE matricula = \'456\''''

cursor.execute(sql)

sql = '''SELECT
    u.nome,
    g.nome
  FROM usuario u
  INNER JOIN usuario g ON g.matricula = u.gerente
  WHERE u.empregado = 1
  ORDER BY g.nome ASC
'''

usuarios = cursor.execute(sql)

for usuario in usuarios:
    print(usuario)

('Marina', 'Helena')
('Helena', 'Marina')